cmsis-svd/cmsis-svd/data/Microchip/ATSAMD09.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Microchip Technology Inc.</vendor>
  <vendorID>MICROCHIP</vendorID>
  <name>ATSAMD09</name>
  <series>SAMD09</series>
  <version>B</version>
  <description>Microchip ATSAMD09 devices</description>
  <licenseText>
  Copyright (c) 2018 Microchip Technology Inc.\n
\n
  SPDX-License-Identifier: Apache-2.0\n
\n
  Licensed under the Apache License, Version 2.0 (the "License");\n
  you may not use this file except in compliance with the License.\n
  You may obtain a copy of the License at\n
\n
  http://www.apache.org/licenses/LICENSE-2.0\n
\n
  Unless required by applicable law or agreed to in writing, software\n
  distributed under the License is distributed on an "AS IS" BASIS,\n
  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n
  See the License for the specific language governing permissions and\n
  limitations under the License.
  </licenseText>
  <cpu>
    <name>CM0+</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <vtorPresent>true</vtorPresent>
    <nvicPrioBits>2</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
    <deviceNumInterrupts>19</deviceNumInterrupts>
  </cpu>
  <headerSystemFilename>system_samd09</headerSystemFilename>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <version>1.2.0</version>
      <description>Analog Digital Converter</description>
      <groupName>ADC</groupName>
      <prependToName>ADC_</prependToName>
      <baseAddress>0x42002000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC</name>
        <value>15</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>REFCTRL</name>
          <description>Reference Control</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>REFSEL</name>
              <description>Reference Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>REFSELSelect</name>
                <enumeratedValue>
                  <name>INT1V</name>
                  <description>1.0V voltage reference</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTVCC0</name>
                  <description>1/1.48 VDDANA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTVCC1</name>
                  <description>1/2 VDDANA (only for VDDANA &gt; 2.0V)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AREFA</name>
                  <description>External reference</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AREFB</name>
                  <description>External reference</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFCOMP</name>
              <description>Reference Buffer Offset Compensation Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AVGCTRL</name>
          <description>Average Control</description>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SAMPLENUM</name>
              <description>Number of Samples to be Collected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>SAMPLENUMSelect</name>
                <enumeratedValue>
                  <name>1</name>
                  <description>1 sample</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2 samples</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4 samples</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 samples</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 samples</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32 samples</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64 samples</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128 samples</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256 samples</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>512 samples</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <description>1024 samples</description>
                  <value>0xa</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADJRES</name>
              <description>Adjusting Result / Division Coefficient</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPCTRL</name>
          <description>Sampling Time Control</description>
          <addressOffset>0x03</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SAMPLEN</name>
              <description>Sampling Time Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x04</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DIFFMODE</name>
              <description>Differential Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LEFTADJ</name>
              <description>Left-Adjusted Result</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FREERUN</name>
              <description>Free Running Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CORREN</name>
              <description>Digital Correction Logic Enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESSEL</name>
              <description>Conversion Result Resolution</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>RESSELSelect</name>
                <enumeratedValue>
                  <name>12BIT</name>
                  <description>12-bit result</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BIT</name>
                  <description>For averaging mode output</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10BIT</name>
                  <description>10-bit result</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8BIT</name>
                  <description>8-bit result</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCALER</name>
              <description>Prescaler Configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>PRESCALERSelect</name>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Peripheral clock divided by 4</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Peripheral clock divided by 8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Peripheral clock divided by 16</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Peripheral clock divided by 32</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>Peripheral clock divided by 64</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>Peripheral clock divided by 128</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>Peripheral clock divided by 256</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV512</name>
                  <description>Peripheral clock divided by 512</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WINCTRL</name>
          <description>Window Monitor Control</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>WINMODE</name>
              <description>Window Monitor Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>WINMODESelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No window mode (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>Mode 1: RESULT &gt; WINLT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <description>Mode 2: RESULT &lt; WINUT</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <description>Mode 3: WINLT &lt; RESULT &lt; WINUT</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE4</name>
                  <description>Mode 4: !(WINLT &lt; RESULT &lt; WINUT)</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWTRIG</name>
          <description>Software Trigger</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLUSH</name>
              <description>ADC Conversion Flush</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START</name>
              <description>ADC Start Conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
